{
    "dialogs": [{
            "id": 1,
            "text": "Выбери персонажа",
            "jumps": [{
                    "dialog_id": 2,
                    "text": "Гарри"
                },
                {
                    "dialog_id": 2,
                    "text": "Гермиона"
                },
                {
                    "dialog_id": 2,
                    "text": "Рон"
                }
            ]
        },
        {
            "id": 2,
            "text": "Вы в лазарете Хогвартса. Вы сожалете о событиях, произошедших этим днем. Крыса Рона оказалась Питером Петтигрю, крестный Гарри заброшен в башню Азкабан и будет подвергнут \"поцелую\" дементора, убит Клювокрыл по вине Малфоя, надежды нет что-то поменять... и Тот Кого Нельзя Называть жив и назревают большие проблемы... Вдруг заходит опечаленный Дамблдор и что-то говорит про время, и что трех оборотов будет достаточно...",
            "jumps": [{
                "dialog_id": 3,
                "text": "Идти дальше"
            }]
        },
        {
            "id": 3,
            "text": "Ты смотришь в надежде на Гермиону, вдруг у нее есть какая-нибудь сумасшедшая идея, чтобы всех спасти...Гермиона предложила помочь сбежать твоему крестному из башни Азкабан. Гермиона, показывает маховик времени и говорит, что вы можете отправиться в прошлое и всё исправить...",
            "jumps": [{
                    "dialog_id": 4,
                    "text": "Использовать маховик времени"
                },
                {
                    "dialog_id": 5,
                    "text": "Не использовать маховик времени"
                }
            ]
        },
        {
            "id": 4,
            "text": "Гермиона крутит маховик, и говорит, что главное условие, чтобы вас никто не видел. Вы исчезаете у Рона на глазах... на часах ровно 7:30... Вы идете к дому Хагрида, в котором находятся ребята из прошлого, прячетесь за кустом рядом с Клювокрылом. К домику лесничего подходит палач за головой Клювокрыла, но он не должен увидеть учеников в доме Хагрида",
            "jumps": [{
                    "dialog_id": 6,
                    "text": "Предупредить ребят из прошлого, что идет палач"
                },
                {
                    "dialog_id": 7,
                    "text": "Не предупреждать, ведь в прошлом они заметили палача в окно"
                }
            ]
        },
        {
            "id": 6,
            "text": "Гермиона, дождавшись момента, когда к дому Хагрида подойдет палач за головой Клювокрыла, кинула камень в Гарри из прошлого. Ребята из прошлого посмотрели в окно и увидели палача. Быстро приготовились выйти с другой части дома Хагрида. Послышался голос Фаджа и они еле успели выскочить во двор и спрятаться за тыквами. Тем временем вы с Гермионой еле успели скрыться в лесу. Вы дождались, как ребята уйдут и отправились спасать Клювокрыла",
            "jumps": [{
                    "dialog_id": 8,
                    "text": "Подойти к Клювокрылу и поклониться"
                },
                {
                    "dialog_id": 9,
                    "text": "Подойти к Клювокрылу и дернуть за цепь, приговаривая \"Пойдем\""
                }
            ]
        },
        {
            "id": 8,
            "text": "Клювокрыл увидел почтение, но все равно не хотел уходить от Хагрида... Находчивая Гермиона принесла дичь из кормушки и поманила за собой в лес. Клювокрыл соблазнился на лакомство и пошел в лес. Только они исчезли в лесу, а вышедшие из дома палач и Фадж удивились, что Клювокрыл сбежал... Тем временем ребят из прошлого поймала гремучая ива, и вы поспешили к ней",
            "jumps": [{
                    "dialog_id": 10,
                    "text": "Оставить Клювокрыла около дерева, не привязывать"
                },
                {
                    "dialog_id": 11,
                    "text": "Привязать Клювокрыла к дереву, чтобы не сбежал"
                }
            ]
        },
        {
            "id": 10,
            "text": "Вы видите, как Гарри побежал отвлекать оборотня... Но если оборотень догонит Гарри, то точно его растерзает... Но в прошлом его отвлекло, как кто-то завыл на луну...",
            "jumps": [{
                "dialog_id": 12,
                "text": "Идти дальше"
            }]
        },
        {
            "id": 12,
            "text": "Гермиона завыла, и вы поняли, что оборотень бежит прямо на вас! Надо бежать и прятаться! Вы пулей понеслись сбивая сучья и спотыкаясь о кочки. Только вы успели перевести дух, спрятавшись за деревом, как услышали тихое рычание. Вы обходите дерево, и вдруг!.. Выскочил оборотень.",
            "jumps": [{
                "dialog_id": 13,
                "text": "Попробовать заклинание \"остолбеней!\""
            }]
        },
        {
            "id": 13,
            "text": "Клювокрыл отпугивает оборотня. Вы идете к озеру, где была схватка с дементорами, но вдруг ты вспоминаешь, что там ты видел отца! Ты говоришь, что хочешь посмотреть, но Гермиона другого мнения... Она думает, что тебе надо спасти себя из прошлого... Каким заклинанием воспользоваться?",
            "jumps": [{
                    "dialog_id": 14,
                    "text": "Дементорос"
                },
                {
                    "dialog_id": 15,
                    "text": "Наутилус"
                },
                {
                    "dialog_id": 16,
                    "text": "Патронус"
                }
            ]
        },
        {
            "id": 16,
            "text": "Ты так захотел спасти кого-то, и поэтому постарался выпустить из души только светлые мысли и у тебя получилось защитное заклинание! Но у вас ещё одно незаконченное дело! Как спасти Сириуса Блэка? Башня Азкабан высокая и находится в непроходимом месте. Надо подлететь к ней, используя",
            "jumps": [{
                    "dialog_id": 17,
                    "text": "Клювокрыла"
                },
                {
                    "dialog_id": 18,
                    "text": "Левиоссо"
                },
                {
                    "dialog_id": 19,
                    "text": "метлу"
                }
            ]
        },
        {
            "id": 17,
            "text": "Вы полетели к башне Азкабан и вот незадача! Заперта дверь... Какое заклятие произнести, чтобы сломать дверь?",
            "jumps": [{
                    "dialog_id": 20,
                    "text": "Бардакус"
                },
                {
                    "dialog_id": 21,
                    "text": "Бамбарда"
                },
                {
                    "dialog_id": 22,
                    "text": "Бамбарбия"
                }
            ]
        },
        {
            "id": 21,
            "text": "Сириус спасён и ты, поняв, что он не виновен, теперь знаешь, что у тебя есть семья, о которой ты мечтал, и крёстный позвал тебя жить с ним) Какая радость! Но Гермиона не унимается, говорит, что вы должны вернуться вовремя!",
            "jumps": [{
                    "dialog_id": 23,
                    "text": "послушать Гермиону"
                },
                {
                    "dialog_id": 24,
                    "text": "уйти с Сириусом из Хогвартса"
                }
            ]
        },
        {
            "id": 23,
            "text": "Вы возвращаетесь в лазарет, видите профессора Дамблдора и сообщаете ему радостную новость, что спасли всех, кто пострадал... Но он ответил: О чём это вы? Приоткрыв двери, вы видите исчезающих себя, уверенно входите в палату, и изумлённый Рон восклицает: - Как это вы сначала здесь, а потом там",
            "jumps": [{
                "dialog_id": 1,
                "text": "вы успешно выполнили задание, спасено: 2, потрачено: 0"
            }]
        },
        {
            "id": 5,
            "text": "Гермиона предложила помочь сбежать твоему крестному из башни Азкабан. Рон попросил вас взять его с собой. Ты сразу начал думать как помочь Рону двигаться самостоятельно. Гермиона предлагает кресло-каталку... Что вы возьмете с собой?",
            "jumps": [{
                    "dialog_id": 25,
                    "text": "взять мантию-невидимку и карту Мародеров"
                },
                {
                    "dialog_id": 26,
                    "text": "вызвать автомоболь семейства Визли, который может летать"
                }
            ]
        },
        {
            "id": 26,
            "text": "Вы втроем идете к башне Азкабан и думаете как помочь сбежать Сириусу Блэку. Что спасло Гарри от Дурслей и позволило ему продолжить обучение в Хогвартсе?",
            "jumps": [{
                    "dialog_id": 27,
                    "text": "бузинная палочка"
                },
                {
                    "dialog_id": 28,
                    "text": "мантия-невидимка"
                },
                {
                    "dialog_id": 29,
                    "text": "автомобиль семьи Визли, который может летать"
                }
            ]
        },
        {
            "id": 29,
            "text": "Рон позвал автомобиль Фордик, и тот мигом примчался. Ребята сели в него, и понеслись по воздуху к башне. Гермиона начала думать, какое заклинание произнести, чтобы отпереть дверь... Бамбарда будет громко и может ранить Сириуса... Решила применить Алохомора. Что делает заклинание Алохомора?",
            "jumps": [{
                    "dialog_id": 30,
                    "text": "взрывает замок"
                },
                {
                    "dialog_id": 31,
                    "text": "взрывает дверь"
                },
                {
                    "dialog_id": 32,
                    "text": "открывает замок"
                }
            ]
        },
        {
            "id": 32,
            "text": "Замок открыт, Сириус Блэк на свободе. Вы садитесь в машину и уезжаете на ней по воздуху в безопасное место. У тебя возникла мысль остаться с Сириусом и бросить Хогвартс, но Гермиона говорит, что надо такие решения принимать не сгоряча.",
            "jumps": [{
                    "dialog_id": 33,
                    "text": "послушать Гермиону"
                },
                {
                    "dialog_id": 34,
                    "text": "уйти с Сириусом из Хогвартса"
                }
            ]
        },
        {
            "id": 33,
            "text": "Вы возвращаетесь в Хогвартс, еще никто вас не хватился. Только профессор Снегг подошел и стал отчитывать за то, что каталку без спроса взяли и зачем вы опять ходите по ночам и что вы задумали... Но это другая история",
            "jumps": [{
                "dialog_id": 1,
                "text": "вы успешно выполнили задание, спасено: 1, потрачено: 1"
            }]
        },
        {
            "id": 7,
            "text": "Палач постучался и услышал, что Хагрид не один, а с учениками и решил ворваться в дом неожиданно. Ребята из прошлого получат выговод от Долорес, а Хагрида уволят за заговор.",
            "jumps": [{
                    "dialog_id": 35,
                    "text": "использовать заклинание удаляющее кусок памяти"
                },
                {
                    "dialog_id": 36,
                    "text": "не предпринимать ничего"
                }
            ]
        },
        {
            "id": 35,
            "text": "Палач впал в некоторое недоумение, почему он оказался в доме Хагрида, увидел ребят и сказал, - Здравствуйте, наверное, я ошибся домом, не понимаю, что я тут делаю... Палач вышел, ребята вышли через задний ход в доме Хагрида, услышав голос Фаджа, тем временем палач, увидев Долорес вспомнил, зачем пришел... пошел обратно и  стал говорить с Хагридом. Тем временем вы с Гермионой еле успели скрыться в лесу. Вы дождались, как ребята уйдут и отправились спасать Клювокрыла",
            "jumps": [{
                    "dialog_id": 8,
                    "text": "Подойти к Клювокрылу и поклониться"
                },
                {
                    "dialog_id": 9,
                    "text": "Подойти к Клювокрылу и дернуть за цепь, приговаривая \"Пойдем\""
                }
            ]
        },
        {
            "id": 9,
            "text": "Клювокрыл создание умное, любит когда по правилам к нему обращаются, вы разозлили Клювокрыла, он начал кричать, и топать, и хлопать крыльями, из-за чего привлек внимание палача и Фаджа... Они высунулись в окно, а вы успели спрятаться за тыквы. Пока взрослые разговаривают, у вас есть еще одна попытка...",
            "jumps": [{
                "dialog_id": 8,
                "text": "Подойти к Клювокрылу и поклониться"
            }]
        },
        {
            "id": 11,
            "text": "Вы видите, как Гарри побежал отвлекать оборотня... Но если оборотень догонит Гарри, то точно его растерзает... Но в прошлом его отвлекло, как кто-то завыл на луну...",
            "jumps": [{
                "dialog_id": 37,
                "text": "Идти дальше"
            }]
        },
        {
            "id": 37,
            "text": "Гермиона завыла, и вы поняли, что оборотень бежит прямо на вас! Надо бежать и прятаться! Вы пулей понеслись сбивая сучья и спотыкаясь о кочки. Только вы успели перевести дух, спрятавшись за деревом, как услышали тихое рычание. Вы обходите дерево, и вдруг!.. Выскочил оборотень.",
            "jumps": [{
                "dialog_id": 38,
                "text": "Попробовать заклинание \"остолбеней!\""
            }]
        },
        {
            "id": 38,
            "text": "Оборотень не реагирует на такие заклинания. Клювокрыл кричит, тем самым призывая оборотня, Люпин уходит в поисках кричащего... Слышатся крики и вой... Вы прибежали и увидели, что Клювокрыл потрепан и оборотень скрылся. Вы идете к озеру, где была схватка с дементорами, но вдруг ты вспоминаешь, что там ты видел отца! Ты говоришь, что хочешь посмотреть, но Гермиона другого мнения... Она думает, что тебе надо спасти себя из прошлого... Каким заклинанием воспользоваться?",
            "jumps": [{
                    "dialog_id": 14,
                    "text": "Дементорос"
                },
                {
                    "dialog_id": 15,
                    "text": "Наутилус"
                },
                {
                    "dialog_id": 16,
                    "text": "Патронус"
                }
            ]
        },
        {
            "id": 14,
            "text": "Какая фантазия! Кто такой Хагрид?",
            "jumps": [{
                    "dialog_id": 13,
                    "text": "лесничий"
                },
                {
                    "dialog_id": 15,
                    "text": "профессор"
                }
            ]
        },
        {
            "id": 15,
            "text": "Неа! Как зовут Клювокрыла?",
            "jumps": [{
                    "dialog_id": 13,
                    "text": "Клюв"
                },
                {
                    "dialog_id": 14,
                    "text": "эй ты!"
                }
            ]
        },
        {
            "id": 18,
            "text": "Левиоссо не унесет в такую даль, за озеро! Используй другое...",
            "jumps": [{
                    "dialog_id": 17,
                    "text": "Клювокрыла"
                },
                {
                    "dialog_id": 19,
                    "text": "метлу"
                }
            ]
        },
        {
            "id": 19,
            "text": "На метле вдвоем летать опасно, тем более Клювокрыла тоже надо куда-то спрятать...",
            "jumps": [{
                "dialog_id": 17,
                "text": "использовать Клювокрыла"
            }]
        },
        {
            "id": 20,
            "text": "Вот это фантазия! Твоя дверь размножилась и теперь ты не знаешь, какую ломать! Полный бардак...",
            "jumps": [{
                    "dialog_id": 21,
                    "text": "Бамбарда"
                },
                {
                    "dialog_id": 22,
                    "text": "Бамбарбия"
                }
            ]
        },
        {
            "id": 22,
            "text": "Кто-то пересмотрел \"Операцию \"Ы\" Подумай получше...",
            "jumps": [{
                    "dialog_id": 20,
                    "text": "Бардакус"
                },
                {
                    "dialog_id": 21,
                    "text": "Бамбарда"
                }
            ]
        },
        {
            "id": 24,
            "text": "Вы с Сириусом садитесь на Клювокрыла и летите в дом крёстного, который достался ему в наследство от Альфреда Блэка. Ты думаешь, что делать дальше...",
            "jumps": [{
                    "dialog_id": 39,
                    "text": "скучать по друзьям и вернуться"
                },
                {
                    "dialog_id": 40,
                    "text": "придумать план, как спасти мир от Волан-де-Морта"
                }
            ]
        },
        {
            "id": 36,
            "text": "Палач застал вас из прошлого с Хагридом и услышал голос Фаджа. Фадж постучался и палач торжественно сказал: \"Смотрите кто тут у нас!\". Фадж тут же окинул взглядом ребят и сказал, что позже с ними разберется... Следом подоспел Дамблдор, он начал говорить, что посылал ребят за...",
            "jumps": [{
                "dialog_id": 41,
                "text": "увести Клювокрыла"
            }]
        },
        {
            "id": 41,
            "text": "Пока Дамблдор объяснял, что Рон с ребятами ходил к Хагриду узнать, куда могла сбежать его крыса, а Рон действительно приходил с этим вопросом, вы стремительно бросились освобождать Клювокрыла, он долго не слушался, и наконец подкормленный Гермионой ушел с вами в лес",
            "jumps": [{
                "dialog_id": 42,
                "text": "Идти далее"
            }]
        },
        {
            "id": 42,
            "text": "Палач вышел во двор и, не увидев никого, чья голова ему нужна, от злости разрубил тыкву... Ребята из прошлого остались у Хагрида и стали думать куда могла исчезнуть Кароста. ",
            "jumps": [{
                    "dialog_id": 43,
                    "text": ""
                },
                {
                    "dialog_id": 44,
                    "text": ""
                }
            ]
        },
        {
            "id": 25,
            "text": "Вы решили пробраться в визжащую хижину под мантией невидимкой и по карте мародеров выслеживать Питера Петтигрю, чтобы поменять местами его с узником Азкабана. Карту мародеров взял Северус Снегг, зная что это что-то что принадлежало Поттеру старшему. Но профессора Снегга не так просто обвести. Гермиона пошла отвлекать Северуса Снегга, а Гарри тем временем должен зайти в кабинет и выкрасть карту.",
            "jumps": [{
                    "dialog_id": 45,
                    "text": "надеть мантию-невидимку и пробраться в кабинет"
                },
                {
                    "dialog_id": 46,
                    "text": "войти в кабинет без мантии"
                }
            ]
        },
        {
            "id": 45,
            "text": "Никто тебя не заметил, и ты взял карту мародеров.",
            "jumps": [{
                    "dialog_id": 47,
                    "text": ""
                },
                {
                    "dialog_id": 48,
                    "text": ""
                }
            ]
        },
        {
            "id": 46,
            "text": "Северус услышал ",
            "jumps": [{
                    "dialog_id": 47,
                    "text": ""
                },
                {
                    "dialog_id": 48,
                    "text": ""
                }
            ]
        }
    ]
}