[{
        "id": 1,
        "text": "Выбери персонажа",
        "jumps": [{
                "dialog_id": 2,
                "text": "Гарри"
            },
            {
                "dialog_id": 2,
                "text": "Гермиона"
            },
            {
                "dialog_id": 2,
                "text": "Рон"
            }
        ]
    },
    {
        "id": 2,
        "text": "Вы в лазарете Хогвартса. Вы сожалете о событиях, произошедших этим днем. Крыса Рона оказалась Питером Петтигрю, крестный Гарри заброшен в башню Темноты и будет подвергнут \"поцелую\" дементора, убит Клювокрыл по вине Малфоя, надежды нет что-то поменять... и Тот Кого Нельзя Называть жив и назревают большие проблемы... Вдруг заходит опечаленный Дамблдор и что-то говорит про время, и что трех оборотов будет достаточно...",
        "jumps": [{
                "dialog_id": 3,
                "text": "Идти дальше"
            },
            {
                "dialog_id": 1,
                "text": "Выйти из игры"
            }
        ]
    },
    {
        "id": 2,
        "text": "Ты смотришь в надежде на Гермиону, вдруг у нее есть какая-нибудь сумасшедшая идея, чтобы всех спасти...",
        "jumps": [{
                "dialog_id": 3,
                "text": "Спросить Гермиону, какие мысли у неё насчет всего этого"
            },
            {
                "dialog_id": 1,
                "text": "Выйти из игры"
            }
        ]
    },
    {
        "id": 3,
        "text": "Гермиона предложила помочь сбежать твоему крестному из башни Темноты. Гермиона, показывает маховик времени и говорит, что вы можете отправиться в прошлое и всё исправить...",
        "jumps": [{
                "dialog_id": 4,
                "text": "Использовать маховик времени"
            },
            {
                "dialog_id": 1,
                "text": "Не использовать маховик времени"
            }
        ]
    },
    {
        "id": 4,
        "text": "Гермиона крутит маховик, и говорит, что главное условие, чтобы вас никто не видел. Вы исчезаете у Рона на глазах... на часах ровно 7:30... Вы идете к дому Хагрида, в котором находятся ребята из прошлого, прячетесь за кустом рядом с Клювокрылом. К домику лесничего подходит палач за головой Клювокрыла, но он не должен увидеть учеников в доме Хагрида",
        "jumps": [{
                "dialog_id": 5,
                "text": "Предупредить ребят из прошлого, что идет палач"
            },
            {
                "dialog_id": 1,
                "text": "Не предупреждать, ведь в прошлом они заметили палача в окно"
            }
        ]
    },
    {
        "id": 5,
        "text": "Гермиона, дождавшись момента, когда к дому Хагрида подойдет палач за головой Клювокрыла, кинула камень в Гарри из прошлого. Ребята из прошлого посмотрели в окно и увидели палача. Быстро приготовились выйти с другой части дома Хагрида. Послышался голос Фаджа и они еле успели выскочить во двор и спрятаться за тыквами. Тем временем вы с Гермионой еле успели скрыться в лесу. Вы дождались, как ребята уйдут и отправились спасать Клювокрыла",
        "jumps": [{
                "dialog_id": 6,
                "text": "Подойти к Клювокрылу и поклониться"
            },
            {
                "dialog_id": 1,
                "text": "Подойти к Клювокрылу и дернуть за цепь, приговаривая \"Пойдем\""
            }
        ]
    }
]